username = input("กรุณากรอก username : ")
password = input("กรุณากรอกPassword : ")
Donut1 = "A1"
Donut2 = "A2"
Donut3 = "A3"
if username == "raphirat" :
    if password == "1234" :
        print("ยินดีต้อนรับเข้าสู่ระบบร้านค้าโดนัทของเรา!!! กรุณาเลือกสินค้า")
        print("--------------รายการสินค้า--------------------")
        print("กดหมายเลข A101 โดนนัทดั้งเดิม        12  THB")
        print("กดหมายเลข A102 โดนัทสตอเบอรี่       15  THB")
        print("กดหมายเลข A103 โดนัทช็อกโกแล็ต      17  THB")
        print("--------------กรุณาเลือกรายการสินค้า--------------------")
else: print("กรุณากรอกรหัสผ่านให้ถูกต้อง")
SelectProduct = input("กรุณาเลือกรายการสินค้า = " )
totalA1 = (int(input("กรุณากรอกจำนวนที่ต้องการซื่อ = ")))
if SelectProduct == "A1" : print("เลือกซื้อโดนัทรสดั้งเดิม รวมเป็นเงินทั้งสิ้น ",totalA1 * 12 , "บาท")
if SelectProduct == "A2" : print("เลือกซื้อโดนัทรสสตอเบอรี่ รวมเป็นเงินทั้งสิ้น ",totalA1 * 15 , "บาท")
if SelectProduct == "A3" : print("เลือกซื้อโดนัทรสช็อคโกแล็ต รวมเป็นเงินทั้งสิ้น ",totalA1 * 17 , "บาท")




